---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleSlotDirection
source: html/72034d36-7a7c-82b2-1baa-10384f1a47fe.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleSlotDirection Property

"Along side 1"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemHoleSlotDirection { get; }
```